# **Data Science Learners Hub**

**Module : SQL**

**Topic :** **ORDER BY Clause**

**email** : [datasciencelearnershub@gmail.com](mailto:datasciencelearnershub@gmail.com)

In [1]:
USE DataScienceLearnersHub

In [7]:
INSERT INTO Emp (id, name, age) VALUES (16,'Arjun', 31)

### **ORDER BY CLause**

- The \`ORDER BY\` clause in SQL is used to sort the result set of a query in ascending or descending order based on one or more columns. It is often used in conjunction with the \`SELECT\` statement to present the data in a specific order.
- By default the order is Ascending \[ASC\] 
- Keyword for descending order is \[DSEC\]

In [ ]:
-- Order employees by salary in descending order
SELECT id, name, salary
FROM Emp
ORDER BY salary DESC;

-- In this example, the `ORDER BY salary DESC` clause sorts the result set based on the "salary" column 
-- in descending order.

### **Peculiarities of the ORDER BY Clause in SQL:**

### **1\. Column Aliases:**

- You can use column aliases in the \`ORDER BY\` clause. However, some database systems may not allow the use of column aliases defined in the \`SELECT\` clause in the \`ORDER BY\` clause. In such cases, you may need to repeat the original expression. In case of MS SQL it allows both

In [8]:
-- ORDER BY with Expression

SELECT id, name, salary * 1.1 AS IncreasedSalary
FROM Emp
ORDER BY salary * 1.1 DESC;

id,name,IncreasedSalary
11,Ramulu,195800.275
12,Bala,178200.000
7,Bunny,93500.550
9,Abhiram,85800.275
5,Nikhil,79200.000
3,Laxman,77000.825
10,Tikram,68200.000
1,Rajesh,66000.000
6,Sarita,63800.825
8,Namrata,55000.550
4,Ganga,52800.275
16,Arjun,NULL

In [9]:
-- ORDER BY with COlumn aliases

SELECT id, name, salary * 1.1 AS IncreasedSalary
FROM Emp
ORDER BY IncreasedSalary DESC;

id,name,IncreasedSalary
11,Ramulu,195800.275
12,Bala,178200.000
7,Bunny,93500.550
9,Abhiram,85800.275
5,Nikhil,79200.000
3,Laxman,77000.825
10,Tikram,68200.000
1,Rajesh,66000.000
6,Sarita,63800.825
8,Namrata,55000.550
4,Ganga,52800.275
16,Arjun,NULL

### **2\. Multiple Columns:**

- You can order by multiple columns by specifying them in a comma-separated list. The sorting is done in the order specified.

In [10]:
SELECT id, name, department, salary
FROM Emp
ORDER BY department ASC, salary DESC;

id,name,department,salary
16,Arjun,NULL,NULL
12,Bala,Finance,162000.00
7,Bunny,Finance,85000.50
3,Laxman,Finance,70000.75
10,Tikram,Finance,62000.00
6,Sarita,HR,58000.75
11,Ramulu,IT,178000.25
9,Abhiram,IT,78000.25
5,Nikhil,IT,72000.00
1,Rajesh,IT,60000.00
8,Namrata,Marketing,50000.50
4,Ganga,Marketing,48000.25

### **3\. Sorting with NULLs:**

- By default, NULL values are sorted as the highest values in ascending order and the lowest values in descending order. You can use the CASE statement  to control whether NULLs appear at the beginning or end of the result set.

In [11]:
-- Order employees by salary in descending order, treating NULLs as the highest values
SELECT id, name, salary
FROM Emp
ORDER BY CASE WHEN salary IS NULL THEN 1 ELSE 0 END, salary DESC;

-- In this query, the `CASE` statement is used to control the sorting of NULL values. 
-- The result is equivalent to treating NULLs as the highest values.

id,name,salary
11,Ramulu,178000.25
12,Bala,162000.00
7,Bunny,85000.50
9,Abhiram,78000.25
5,Nikhil,72000.00
3,Laxman,70000.75
10,Tikram,62000.00
1,Rajesh,60000.00
6,Sarita,58000.75
8,Namrata,50000.50
4,Ganga,48000.25
16,Arjun,NULL

### **Understanding the above query**

1\. **CASE Statement:**

- The \`CASE\` statement is used to create a conditional expression. In this case, it evaluates whether the "salary" column is NULL. If a salary is NULL, it assigns a value of 1; otherwise, it assigns a value of 0.
    
- CASE WHEN salary IS NULL THEN 1 ELSE 0 END
    
- So, for each row in the result set, this part of the \`ORDER BY\` clause will generate either 1 or 0 based on the condition.
    

2\. **salary DESC:**

- The second part of the \`ORDER BY\` clause specifies the sorting based on the "salary" column in descending order (\`DESC\`). This means that non-NULL salaries will be sorted from highest to lowest.
    
-  If the "salary" is NULL for a particular row, the preceding \`CASE\` expression will determine whether it should be treated as the highest (1) or lowest (0) value for sorting purposes.
    
- So, the combination of the \`CASE\` statement and the \`salary DESC\` part in the \`ORDER BY\` clause achieves the following sorting logic:
    
    - Rows with NULL salary values will be placed at the end of the result set because they get a value of 1 from the \`CASE\` statement (1 is treated as a higher value).
        
    - Non-NULL salary values will be sorted in descending order (from highest to lowest).
        

<span style="font-size: 13px;">3.&nbsp;</span>  <span style="color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;; font-size: 13px;">In summary, this query sorts the result set in a way that places rows with NULL salaries at the end, and among non-NULL salaries, it sorts them from highest to lowest.</span>

<span style="color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;; font-size: 13px;">4.&nbsp;</span> <span style="color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;; font-size: 13px;">The key is to understand that the </span> **CASE** <span style="color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;; font-size: 13px;"> statement is used to create a sorting criterion, and the </span> **ORDER BY** <span style="color: rgb(0, 0, 0); font-family: &quot;Helvetica Neue&quot;; font-size: 13px;"> clause then uses this criterion for sorting the result set.</span>

In [12]:
SELECT id, name, salary
FROM Emp
ORDER BY CASE WHEN salary IS NULL THEN 0 ELSE 1 END, salary DESC;

id,name,salary
16,Arjun,NULL
11,Ramulu,178000.25
12,Bala,162000.00
7,Bunny,85000.50
9,Abhiram,78000.25
5,Nikhil,72000.00
3,Laxman,70000.75
10,Tikram,62000.00
1,Rajesh,60000.00
6,Sarita,58000.75
8,Namrata,50000.50
4,Ganga,48000.25

### **4\. Sorting by Expression:**

- You can sort by an expression rather than a column name. The expression can involve arithmetic operations, functions, or combinations of columns.

In [13]:
SELECT id, name, age
FROM Emp
ORDER BY CASE WHEN age < 30 THEN 1 ELSE 0 END, age DESC;

id,name,age
11,Ramulu,58
12,Bala,51
7,Bunny,40
9,Abhiram,38
3,Laxman,35
5,Nikhil,32
10,Tikram,31
16,Arjun,31
1,Rajesh,30
6,Sarita,29
4,Ganga,28
8,Namrata,26

In [14]:
SELECT id, name, age
FROM Emp
ORDER BY LEN(name), age DESC;

id,name,age
12,Bala,51
7,Bunny,40
16,Arjun,31
4,Ganga,28
11,Ramulu,58
3,Laxman,35
5,Nikhil,32
10,Tikram,31
1,Rajesh,30
6,Sarita,29
9,Abhiram,38
8,Namrata,26

### **5\. Limiting the Result Set:**

- You can use the TOP clauses in conjunction with \`ORDER BY\` to limit the number of rows returned after sorting.

In [15]:
-- Order employees by salary in descending order and limit to 5 rows
SELECT TOP 5 id, name, salary
FROM Emp
ORDER BY salary DESC;

id,name,salary
11,Ramulu,178000.25
12,Bala,162000.00
7,Bunny,85000.50
9,Abhiram,78000.25
5,Nikhil,72000.00